1CСпециалист_по_платформе/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ПартииНоменклатуры</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

1CСпециалист_по_платформе/src/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	ПересчитатьСумму(Элементы.СписокНоменклатуры.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	ПересчитатьСумму(Элементы.СписокНоменклатуры.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму(СтрСписка)
	СтрСписка.Сумма = СтрСписка.Цена * СтрСписка.Количество;

	Объект.СуммаПоДокументу = 0;

	Для Каждого СтрСН Из Объект.СписокНоменклатуры Цикл
		Объект.СуммаПоДокументу = Объект.СуммаПоДокументу + СтрСН.Сумма;
	КонецЦикла;

КонецПроцедуры
